doc/src/hibari/images-src/gdq0005_typical_seq_get.msc
## -*- mode: graphviz-dot -*-
## vim: set syntax=dot:

##
## Copyright (c) 2005-2010 Gemini Mobile Technologies, Inc.  All rights reserved.
##
## Licensed under the Apache License, Version 2.0 (the "License");
## you may not use this file except in compliance with the License.
## You may obtain a copy of the License at
##
##     http://www.apache.org/licenses/LICENSE-2.0
##
## Unless required by applicable law or agreed to in writing, software
## distributed under the License is distributed on an "AS IS" BASIS,
## WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
## See the License for the specific language governing permissions and
## limitations under the License.
##

msc {
    CL [label = "GDSS\nClient"],
    H [label = "GDSS\nHead"],
    HD [label = "H Disk"],
    M [label = "GDSS\nMiddle"],
    MD [label = "M Disk"],
    T [label = "GDSS\nTail"],
    TD [label = "T Disk"];

    CL -> T [label = "[1] get(K)"];

    T -> T [label = "[2] get position of V"];
    T -> TD [label = "[3.1] read V"];
    T <- TD [label = "[3.2] ok V"];

    CL <- T [label = "[4] ok V"];
}
