doc/src/hibari/images-src/write-path-1.dot
//
// Copyright (c) 2005-2010 Gemini Mobile Technologies, Inc.  All rights reserved.
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//

digraph data_flow {
    CLIENT [label="Client"];
    HEAD [label="Standalone Brick"];
    {rank=same; HEAD};

    CLIENT -> HEAD [label="Update request"];
    HEAD -> CLIENT [label="Update reply"];
};
